---
kind: method
id: M:Autodesk.Revit.DB.Analysis.SpatialFieldManager.AddSpatialFieldPrimitive
source: html/c7dd1e50-ef84-7cb8-77f2-323541471aaf.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager.AddSpatialFieldPrimitive Method

Creates empty analysis results primitive not associated with any geometry element

## Syntax (C#)
```csharp
public int AddSpatialFieldPrimitive()
```

## Returns
Unique index of primitive for future references